Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.DimensionExaggerationAttributes Class
 The DimensionExaggerationAttributes class handles attributes related to the exaggeration of dimension lines.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionExaggerationAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class DimensionExaggerationAttributes : GenericAttributesBase
<SerializableAttribute>
Public NotInheritable Class DimensionExaggerationAttributes
	Inherits GenericAttributesBase
The DimensionSetBaseAttributes.DimensionExaggerationAttributes type exposes the following members.
Constructors
Name | Description
DimensionSetBaseAttributes.DimensionExaggerationAttributes()
 Creates a new dimension exaggeration attributes instance. The default is to have exaggeration disabled.
DimensionSetBaseAttributes.DimensionExaggerationAttributes(Boolean, DimensionSetBaseAttributes.ExaggerationDirections, DimensionSetBaseAttributes.ExaggerationOrigins, Double, Double, Double)
 Creates a new dimension exaggeration attributes instance with the given parameters.
Top
Properties
Name | Description
ExaggerationDirection
 The ExaggerationDirection.
ExaggerationEnabled
 Exaggeration is enabled if the value is true.
ExaggerationHeight
 The ExaggerationHeight.
ExaggerationOrigin
 The ExaggerationOrigin.
ExaggerationPosition
 The ExaggerationPosition.
ExaggerationWidth
 The ExaggerationWidth.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace